ExchangePlans/vrgМобильныеСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<ExchangePlan>
		<Properties>
			<Name>vrgМобильныеСклад</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтбораСхемыОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДляВходаНаУстройстве</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРедактированиеДатыДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьКоличествоПриСканировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтосохранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтосохранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДоступностиРедактированияДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКартинки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейХраненияДокументовНаУстройстве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоПривязано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеТаблицыКомандРабочегоСтола</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписиДокументовПриОбмене</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументИнвентаризация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументПоступление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументРеализация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументСписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументОприходование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументВозвратОтКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументЗаказКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументЗаказПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУниверсальныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРедактированиеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументТребованиеНакладная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМаршрутныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

InformationRegisters/vrgОстаткиНаСкладахМобильныеСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>vrgОстаткиНаСкладахМобильныеСклад</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/vrgНастройкиМобильныхУстройств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>vrgНастройкиМобильныхУстройств</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелУстройства</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.vrgМобильныеСклад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ExchangePlans/vrgМобильныеСклад/Forms/ФормаСпискаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоставОтправляемыхДанных(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	//ОбменДаннымиКлиент.ОткрытьСоставОтправляемыхДанных(ТекущиеДанные.Ссылка);
	ПроцедурыОбменаДаннымиКлиент.ПоказатьЗарегистрированныеИзмененияДляУзла(ТекущиеДанные.Ссылка, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура НачальнаяИнициализация(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.Ссылка = ЭтотУзел Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("УзелОбмена", ТекущиеДанные.Ссылка);
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ВопросНачальнаяИнициализацияЗавершение", ЭтаФорма, ДополнительныеПараметры);
	ТекстВопроса = "Операция может занять длительное время. Продолжить?";
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьНачальнуюИнициализациюУзла(УзелОбмена)

	Попытка
		vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ВыполнитьНачальнуюИнициализациюДляУзлаМобильногоУстройства(УзелОбмена, Ложь);
		Сообщить("Готово!");
	Исключение
		Сообщить("Не удалось выполнить начальную инициализацию по причине " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ВопросНачальнаяИнициализацияЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьНачальнуюИнициализациюУзла(ДополнительныеПараметры.УзелОбмена);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВключитьОтключитьОбменСМобильнымиУстройствамиНаСервере()

	Если ИспользуетсяМобильноеПриложениеOctopus Тогда
		Константы.vrg_ИспользуетсяМобильноеПриложениеOctopus.Установить(Ложь);
	Иначе
		Константы.vrg_ИспользуетсяМобильноеПриложениеOctopus.Установить(Истина);
	КонецЕсли;
	УстановитьТекстКомандыВключитьОтключитьОбменСМобильнымиУстройствами();

КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтключитьОбменСМобильнымиУстройствами(Команда)

	ИспользуетсяМобильноеПриложениеOctopus = ПолучитьЗначениеКонстантыИспользованияOctopus();
	Если ИспользуетсяМобильноеПриложениеOctopus Тогда
		ТекстВопроса = "Данная функция делает невозможной синхронизацию с мобильными устройствами. Вы уверены, что хотите отключить механизмы обмена и регистрации данных?";
	Иначе
		ТекстВопроса = "Данная функция включает возможность синхронизации с мобильными устройствами. Вы уверены, что хотите продолжить?";
	КонецЕсли;
	ОписаниеОповещенияЗавершения = Новый ОписаниеОповещения("ВопросВключитьОтключитьОбменСМобильнымиУстройствамиЗавершение", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияЗавершения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);

КонецПроцедуры

&НаКлиенте
Процедура ВопросВключитьОтключитьОбменСМобильнымиУстройствамиЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ВключитьОтключитьОбменСМобильнымиУстройствамиНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьТекстКомандыВключитьОтключитьОбменСМобильнымиУстройствами()

	ИспользуетсяМобильноеПриложениеOctopus = ПолучитьЗначениеКонстантыИспользованияOctopus();
	Если ИспользуетсяМобильноеПриложениеOctopus Тогда
		ТекстКнопки = "Синхронизация с мобильными устройствами включена";
		КартинкаКнопки = БиблиотекаКартинок.Утвердить;
	Иначе
		ТекстКнопки = "Синхронизация с мобильными устройствами отключена";
		КартинкаКнопки = БиблиотекаКартинок.Остановить;
	КонецЕсли;
	Элементы.ФормаВключитьОтключитьОбменСМобильнымиУстройствами.Заголовок = ТекстКнопки;
	Элементы.ФормаВключитьОтключитьОбменСМобильнымиУстройствами.Картинка = КартинкаКнопки;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстантыИспользованияOctopus()

	Возврат Константы.vrg_ИспользуетсяМобильноеПриложениеOctopus.Получить();

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстантыИспользованияХозрасчетного()

	Возврат Константы.vrg_ИспользоватьХозрасчетныйДляОстатковOctopus.Получить();

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтотУзел = ПланыОбмена.vrgМобильныеСклад.ЭтотУзел();
	УстановитьТекстКомандыВключитьОтключитьОбменСМобильнымиУстройствами();
	УстановитьТекстКомандыВключитьОтключитьИспользоватьХозрасчетныйДляОстатков();
	ВерсияУстройств = Константы.DeviceVersion.Получить();
	
	Элементы.ФормаВключитьОтключитьХозрасчетныйДляОстатков.Видимость = (Метаданные.РегистрыБухгалтерии.Найти("Хозрасчетный") <> Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ИсторияОбменов(Команда)

	ОткрытьФорму("РегистрСведений.vrgИсторияОбменаДаннымиСМобильнымиУстройствами.Форма.ФормаСписка");

КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтключитьИспользоватьХозрасчетныйДляОстатков(Команда)

	ИспользуетсяХозрасчетныйДляОстатков = ПолучитьЗначениеКонстантыИспользованияХозрасчетного();
	Если ИспользуетсяХозрасчетныйДляОстатков Тогда
		ТекстВопроса = "Данная функция переключит остатки для мобильных устройств с Хозрасчетного (регистр бухгалтерии) на Товары на складах (регистр накопления). Вы уверены, что хотите продолжить?";
	Иначе
		ТекстВопроса = "Данная функция переключит остатки для мобильных устройств с Товаров на складах (регистр накопления) на Хозрасчетный (регистр бухгалтерии). Вы уверены, что хотите продолжить?";
	КонецЕсли;
	ОписаниеОповещенияЗавершения = Новый ОписаниеОповещения("ВопросВключитьОтключитьИспользоватьХозрасчетныйДляОстатковЗавершение", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияЗавершения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);

КонецПроцедуры

&НаКлиенте
Процедура ВопросВключитьОтключитьИспользоватьХозрасчетныйДляОстатковЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ВключитьОтключитьИспользоватьХозрасчетныйДляОстатковНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВключитьОтключитьИспользоватьХозрасчетныйДляОстатковНаСервере()

	Если ИспользуетсяХозрасчетныйДляОстатков Тогда
		Константы.vrg_ИспользоватьХозрасчетныйДляОстатковOctopus.Установить(Ложь);
	Иначе
		Константы.vrg_ИспользоватьХозрасчетныйДляОстатковOctopus.Установить(Истина);
	КонецЕсли;
	УстановитьТекстКомандыВключитьОтключитьИспользоватьХозрасчетныйДляОстатков();

КонецПроцедуры

&НаСервере
Процедура УстановитьТекстКомандыВключитьОтключитьИспользоватьХозрасчетныйДляОстатков()

	ИспользуетсяХозрасчетныйДляОстатков = ПолучитьЗначениеКонстантыИспользованияХозрасчетного();
	Если ИспользуетсяХозрасчетныйДляОстатков Тогда
		ТекстКнопки = "Регистр для остатков: Хозрасчетный (журнал проводок)";
		КартинкаКнопки = БиблиотекаКартинок.РегистрБухгалтерии;
	Иначе
		ТекстКнопки = "Регистр для остатков: Остатки на складах";
		КартинкаКнопки = БиблиотекаКартинок.РегистрНакопления;
	КонецЕсли;
	Элементы.ФормаВключитьОтключитьХозрасчетныйДляОстатков.Заголовок = ТекстКнопки;
	Элементы.ФормаВключитьОтключитьХозрасчетныйДляОстатков.Картинка = КартинкаКнопки;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.Ссылка = ЭтотУзел Тогда
		Возврат;
	КонецЕсли;

	УзелОбмена = ТекущиеДанные.Ссылка;
	//ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ВопросНачальнаяИнициализацияЗавершение", ЭтаФорма, ДополнительныеПараметры);
	//ТекстВопроса = "Операция может занять длительное время. Продолжить?";
	//ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vrgОстаткиНаСкладахМобильныеСклад.Склад,
		|	vrgОстаткиНаСкладахМобильныеСклад.Номенклатура,
		|	vrgОстаткиНаСкладахМобильныеСклад.СерияНоменклатуры,
		|	vrgОстаткиНаСкладахМобильныеСклад.ХарактеристикаНоменклатуры,
		|	vrgОстаткиНаСкладахМобильныеСклад.Количество
		|ИЗ
		|	РегистрСведений.vrgОстаткиНаСкладахМобильныеСклад КАК vrgОстаткиНаСкладахМобильныеСклад";
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.vrgОстаткиНаСкладахМобильныеСклад.СоздатьНаборЗаписей();
	Для Каждого Строка из РезультатЗапроса Цикл
		Набор.Отбор.Номенклатура.Значение = Строка.Номенклатура;
		Набор.Отбор.Номенклатура.Использование = Истина;
		
		Набор.Отбор.ХарактеристикаНоменклатуры.Значение = Строка.ХарактеристикаНоменклатуры;
		Набор.Отбор.ХарактеристикаНоменклатуры.Использование = Истина;
		
		//Набор.Отбор.Количество.Значение = Строка.Количество;
		//Набор.Отбор.Количество.Использование = Истина;
		//
		Набор.Отбор.СерияНоменклатуры.Значение = Строка.СерияНоменклатуры;
		Набор.Отбор.СерияНоменклатуры.Использование = Истина;
		
		Набор.Отбор.Склад.Значение = Строка.Склад;
		Набор.Отбор.Склад.Использование = Истина;
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Набор);
	КонецЦикла;

КонецПроцедуры

Процедура ОбновлениеОстатковРегистрНаСервере(КодУстройства,ИдентификаторУстройства)
	//+NovashIV_15.05.2023

	УстановитьПривилегированныйРежим(Истина);

	УзелУстройства = ПолучитьПроверитьУзелУстройства(КодУстройства, ИдентификаторУстройства);

	ДанныеОбмена = vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ВыгрузитьОстаткиНаМобильноеУстройство(УзелУстройства);
	УстановитьПривилегированныйРежим(Ложь);
	//-NovashIV_15.05.2023
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОстатковРегистр(Команда)
	//+NovashIV_15.05.2023
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.Ссылка = ЭтотУзел Тогда
		Возврат;
	КонецЕсли;

	УзелОбмена = ТекущиеДанные.Ссылка;

	КодУстройства           = УзелОбмена.Код;
	
	ЗаписьНастроек = РегистрыСведений.vrgНастройкиМобильныхУстройств.СоздатьМенеджерЗаписи();
	ЗаписьНастроек.УзелУстройства = УзелОбмена;
	ЗаписьНастроек.Прочитать();
	Если ЗаписьНастроек.Выбран() Тогда
		ИдентификаторУстройства = ЗаписьНастроек.ИдентификаторУстройства;
	КонецЕсли;

	ОбновлениеОстатковРегистрНаСервере(КодУстройства,ИдентификаторУстройства);
	//-NovashIV_15.05.2023
КонецПроцедуры

Функция ПолучитьПроверитьУзелУстройства(КодУстройства, ИдентификаторУстройства, ТекстОшибки = Неопределено)
	//+NovashIV_15.05.2023
	
	ИспользуетсяМобильноеПриложениеOctopus = Константы.vrg_ИспользуетсяМобильноеПриложениеOctopus.Получить();
	Если НЕ ИспользуетсяМобильноеПриложениеOctopus Тогда
		ВызватьИсключение("Синхронизация с мобильными устройствами отключена.");
	КонецЕсли;
	
	УзелУстройства = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(КодУстройства);
	
	Если УзелУстройства.Пустая() Тогда
		ВызватьИсключение("Устройство с кодом " + КодУстройства+" не опознано");
	ИначеЕсли УзелУстройства.ЗапретДоступа Тогда
		ВызватьИсключение("Доступ к данным с этого устройства запрещен.");
	Иначе
		ЗаписьНастроек = РегистрыСведений.vrgНастройкиМобильныхУстройств.СоздатьМенеджерЗаписи();
		ЗаписьНастроек.УзелУстройства = УзелУстройства;
		ЗаписьНастроек.Прочитать();
		Если ЗаписьНастроек.Выбран() Тогда
			Если ЗначениеЗаполнено(ИдентификаторУстройства) И ЗначениеЗаполнено(ЗаписьНастроек.ИдентификаторУстройства)
				И ИдентификаторУстройства <> ЗаписьНастроек.ИдентификаторУстройства Тогда
				ВызватьИсключение("Данный узел обмена уже закреплен за другим устройством.");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат УзелУстройства;
	//-NovashIV_15.05.2023
	
КонецФункции
